Revit.AnalysisDisplay.AbstractAnalysisDisplay.InternalSetPrimitiveId(System.Int32)
Set the SpatialFieldPrimitiveId
primitiveId:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.ResultsSchemaName
The unique name for Dynamo's Analysis Results.  Used to identify
the results scheme.

Revit.AnalysisDisplay.AbstractAnalysisDisplay.GetAnalysisResultSchemaIndex
Get the AnalysisResultsSchemaIndex for the SpatialFieldManager
Returns:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.SetElementAndPrimitiveIdForTrace(Autodesk.Revit.DB.Analysis.SpatialFieldManager,System.Int32)
Set the SpatialFieldManager and PrimitiveId in Thread Local Storage
manager:
primitiveId:

Revit.AnalysisDisplay.AbstractAnalysisDisplay.SetElementAndPrimitiveIdForTrace
Set the current SpatialFieldManager and PrimitiveId in Thread Local Storage

Revit.AnalysisDisplay.AbstractAnalysisDisplay.SpatialFieldPrimitiveId
The Id for this SpatialFieldPrimitive